package lesson2;

public class DZ2 //Создать строку string = "Testing, is my favourite job".
// Вывести на экран отдельно каждое слово и длину этого слова в след виде:
// Cлово1 = (значение слова), Длина этого слова = (значение длины слов).
// Cлово2 = (значение слова), Длина этого слова = (значение длины слов).и т.д.
// Вывести на консоль true, если первое слово длиннее остальных, в
// противном случае вывести false.


        {
                public static void main(String[] args) {


                        String text0 = "Testing, is my favourite job";
                        String word1 = "(Testing) + 7 = (sewen)";
                        String word2 = "(is) + 2 = (two)";
                        String word3 = "(my) + 2 = (two)";
                        String word4 = "(favourite) + 9 = (nine)";
                        String word5 = "(job) + 3 = (three)";
                        System.out.println (false);

                        //


                }

}
