package lesson9.kalkulator;

public class Kalkulator

 /*Створити клас калькулятор.
У ньому створити методи:
summ,
minus,
multiply,
division.
(Додавання, віднімання, множення та поділ відповідно.)
Кожен метод приймає як параметри два значення типу double. І виводить у консоль результат дії.
Також у класі є метод старт. Який виводить повідомлення в консоль, що калькулятор запущено.
І пропонує ввести дію у вашій консолі.
Калькулятор повинен приймати лише такі типи дій:
2+4; - приклад синтаксису додавання;
5-6; - приклад синтаксису віднімання;
25*3; - Приклад синтаксису множення;
34/3; - Приклад синтаксису поділу;
Після введення на консоль виводиться відповідь цієї дії.
 І потім знову виводиться повідомлення про пропозицію ввести дію.
Програма закривається після введення Stop. Перед закриттям на консоль має виводитись повідомлення:
"Калькулятор закрито".*/ {

    public int summ(int a, int b) {
        return a + b;
    }

    public int minus(int a, int b) {
        return a - b;
    }

    public int multiply(int a, int b) {
        return a * b;
    }
    public int division (int a, int b) {
        return a / b;
    }
    }
